if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"

  brew "mas"
  brew "noti"

  cask "font-3270-nerd-font"
  cask "font-cascadia-mono"
  cask "font-fira-code"
  cask "font-fira-code-nerd-font"
  cask "font-jetbrains-mono"
  cask "font-source-code-pro"
  cask "font-victor-mono"

  cask "kitty"
  cask "notion"
  cask "postman"
  cask "firefox"
  cask "google-chrome"

  mas "Drafts", id: 1435957248
  mas "Fantastical", id: 975937182
  mas "Octotree Pro", id: 1457450145
  mas "Xcode", id: 497799835
elsif OS.linux?
  brew "cabextract"
  brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"

brew "ack"
brew "bat"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "markdown"
brew "neofetch"
brew "neovim --HEAD"
brew "ninja"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "z"
brew "zsh"
