tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"
brew "neovim"
brew "noti"
brew "highlight"

cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"

cask "brave-browser"
cask "discord"
cask "kitty"
cask "notion"
cask "postman"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"
cask "wezterm"

tap "homebrew/bundle"
tap "homebrew/core"

brew "ack"
brew "bat"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "efm-langserver"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "make"
brew "markdown"
brew "neofetch"
brew "ninja"
brew "python"
brew "ripgrep"
brew "shellcheck"
# brew "koekeishiya/formulae/skhd"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
# brew "koekeishiya/formulae/yabai"
brew "z"
brew "zsh"
