brew "mas"
brew "neovim"
brew "noti"
brew "highlight"

cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"

cask "alacritty"
cask "brave-browser"
cask "discord"
cask "ghostty"
cask "kitty"
cask "notion"
cask "postman"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"
cask "wezterm"

tap "homebrew/bundle"
tap "FelixKratz/formulae"

brew "ack"
brew "ast-grep"
brew "bash"
brew "bat"
brew "black"
brew "chafa"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "efm-langserver"
brew "eza"
brew "fd"
brew "flake8"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "font-hack-nerd-font"
brew "font-sf-pro"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "make"
brew "markdown"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "ninja"
brew "prettier"
brew "powerlevel10k"
brew "python"
brew "ripgrep"
brew "sf-symbols"
brew "shellcheck"
brew "koekeishiya/formulae/skhd"
brew "sketchybar"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "tree"
brew "vim"
brew "viu"
brew "wget"
brew "koekeishiya/formulae/yabai"
brew "z"
brew "zsh"

