adpyke.codesnap
alefragnani.project-manager
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
dbaeumer.vscode-eslint
EditorConfig.EditorConfig
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
mikestead.dotenv
ms-azuretools.vscode-docker
ms-playwright.playwright
orta.vscode-jest
pmndrs.pmndrs
Prisma.prisma
quicktype.quicktype
rangav.vscode-thunder-client
seonglae.one-dark-teal
timonwong.shellcheck
unifiedjs.vscode-mdx
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
yoavbls.pretty-ts-errors

